{
    "version": "https://jsonfeed.org/version/1",
    "title": "agilesoftwarearchitect",
    "description": "",
    "home_page_url": "https://blog.agilesoftwarearchitect.com",
    "feed_url": "https://blog.agilesoftwarearchitect.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Shawn Lim"
    },
    "items": [
        {
            "id": "https://blog.agilesoftwarearchitect.com/hello-world.html",
            "url": "https://blog.agilesoftwarearchitect.com/hello-world.html",
            "title": "Hello World",
            "summary": "My name is Shawn. I'm a Principal Software Engineer / Architect at Traveloka. I enjoy sharing knowledge about Software Engineering with others. Background in business and entrepreneurship. I am equipped with heavy technical knowledge in frontend, backend &amp; infrastructure. Because of this unique intersection between&hellip;",
            "content_html": "<p>My name is Shawn. I'm a Principal Software Engineer / Architect at <a href=\"https://www.linkedin.com/company/traveloka-com\">Traveloka</a>. I enjoy sharing knowledge about Software Engineering with others.</p>\n<h2>About me</h2>\n<p>Background in business and entrepreneurship. I am equipped with heavy technical knowledge in frontend, backend &amp; infrastructure. Because of this unique intersection between business &amp; software engineering, I can easily influence and win the trust of people from both sides.<br><br>My story began with a startup I founded to make writing more accessible and fun for everyone. Learning how to design and scale this website brought me towards a career in software engineering, a craft I truly enjoy up till this day. I was engineer #4 in Carousell (a Singapore unicorn company), built and scaled their web application from Singapore to the rest of SEA. Later on, I built from scratch high profile projects in several large companies. Currently, I am a Software Architect in Traveloka (an Indonesian unicorn) with organizational impact of 100+ engineers across multiple domains.<br><br>People who have worked with me can usually spot my passion in honing my craft. While my primary interest is in designing systems that scale, I also enjoy mentoring other engineers and helping them expand their skills. <br><br>On the side, I experiment with ideas and start my own projects. Many of which mainly serve to push myself beyond what I know. I also enjoy building interesting things in the open source world. See https://github.com/geekyme for some of my contributions.<br><br>I’m always learning about design, technology, startups, and people. <a href=\"https://www.linkedin.com/in/geekyme/\">Connect with me</a> if we have a common interest / topic to discuss about. 🍻</p>",
            "author": {
                "name": "Shawn Lim"
            },
            "tags": [
            ],
            "date_published": "2021-01-01T19:23:13+08:00",
            "date_modified": "2021-01-01T19:23:13+08:00"
        }
    ]
}
